package com.suda.voice;

import java.math.BigDecimal;
import java.text.DecimalFormat;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.LinkedList;
import java.util.List;
import java.util.Map;
/**
 * Created by lijian on 2016/11/21.
 */
public class function {
    static double EARTH_RADIUS = 6378137; // radius of earth
    public double rad(double d)
    {
        return d * Math.PI / 180.0;
    }

    //计算自己坐标和图书馆位置的距离
    public  double GeShortDistance(double lon1, double lat1, String point)
    {

        String []temp = point.split(",");
        double lon2 = Double.parseDouble(temp[0]);
        double lat2 = Double.parseDouble(temp[1]);
        double radLat1 = rad(lat1);
        double radLat2 = rad(lat2);

        double radLon1 = rad(lon1);
        double radLon2 = rad(lon2);

        if (radLat1 < 0)
            radLat1 = Math.PI / 2 + Math.abs(radLat1);// south
        if (radLat1 > 0)
            radLat1 = Math.PI / 2 - Math.abs(radLat1);// north
        if (radLon1 < 0)
            radLon1 = Math.PI * 2 - Math.abs(radLon1);// west
        if (radLat2 < 0)
            radLat2 = Math.PI / 2 + Math.abs(radLat2);// south
        if (radLat2 > 0)
            radLat2 = Math.PI / 2 - Math.abs(radLat2);// north
        if (radLon2 < 0)
            radLon2 = Math.PI * 2 - Math.abs(radLon2);// west
        double x1 = EARTH_RADIUS * Math.cos(radLon1) * Math.sin(radLat1);
        double y1 = EARTH_RADIUS * Math.sin(radLon1) * Math.sin(radLat1);
        double z1 = EARTH_RADIUS * Math.cos(radLat1);

        double x2 = EARTH_RADIUS * Math.cos(radLon2) * Math.sin(radLat2);
        double y2 = EARTH_RADIUS * Math.sin(radLon2) * Math.sin(radLat2);
        double z2 = EARTH_RADIUS * Math.cos(radLat2);

        double d = Math.sqrt((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2)+ (z1 - z2) * (z1 - z2));
        //余弦定理求夹角
        double theta = Math.acos((EARTH_RADIUS * EARTH_RADIUS + EARTH_RADIUS * EARTH_RADIUS - d * d) / (2 * EARTH_RADIUS * EARTH_RADIUS));
        double dist = theta * EARTH_RADIUS;
        return dist;
    }

    public String getpositon(Map<String,String> map, String name){
        for(String key:map.keySet()){
            if(name.contains(key)){
                return map.get(key);
            }
        }
        return "no";
    }
    public int com(double a,double b){
        BigDecimal data1 = new BigDecimal(a);
        BigDecimal data2 = new BigDecimal(b);
        if(data1.compareTo(data2) == 0){
            return 0;
        }else if(data1.compareTo(data2) < 0){
            return -1;
        }else{
            return 1;
        }
    }

    /*public Double Min(List<Double> alldis ){
        double min = Double.MAX_VALUE;
        for (int i = 0;i<alldis.size();i++){
            if(com(alldis.get(i),min) == -1){
                min = alldis.get(i);
            }
        }
        return min;
    }*/

    public double getdis(Map<String,String> map,Book b,double lon,double lat){
        double min = Double.MAX_VALUE;
        int count = 0;
        for(int i = 0 ;i<b.getHoldPlaces().length;i++){
            if(!b.getHoldPlaces()[i].contains("乡镇、村(社区)流通点")){
                String position = getpositon(map,b.getHoldPlaces()[i]);
                if(!position.equals("no")){
                    double temp = Math.min(min,GeShortDistance(lon,lat,position));
                    if(com(temp,min) == -1){
                        min = temp;
                        count = i;
                    }
                }
            }
        }
        if(min==Double.MAX_VALUE){
            return 0;
        }else {
            DecimalFormat df = new DecimalFormat("######0.00");
            b.setPosition(b.getHoldPlaces()[count]);
            b.setDistance(Double.valueOf(df.format(min/1000)));
            return min;
        }
    }

    public void sortbid(double []alldis,String []allbid){
        int min = 0;
        for(int i = 0;i<alldis.length-1;i++) {
            min=i;
            for(int j=i+1;j<alldis.length;j++) {
                if(com(alldis[j],alldis[min]) == -1)
                {
                    min=j;
                }
            }
            if(min!=i)
            {
                double temp = alldis[i];
                String temp1 = allbid[i];
                alldis[i] = alldis[min];
                allbid[i] = allbid[min];
                alldis[min] = temp;
                allbid[min] = temp1;
            }
        }
    }

    public void sortdis(List<Book> chooseList,double lon,double lat){
        Map<String,String> map = new HashMap<String,String>();
        List<Book> temp = new LinkedList<Book>();
        String []allbid = new String[chooseList.size()];
        double []alldis = new double[chooseList.size()];
        input(map);
        for(int i = 0;i<chooseList.size();i++){
            double dis = getdis(map,chooseList.get(i),lon,lat);
            alldis[i] = dis;
            allbid[i] = chooseList.get(i).getbId();
        }
        sortbid(alldis,allbid);
        for (int  i = 0;i<allbid.length;i++){
            for(int j = 0;j<chooseList.size();j++){
                if(allbid[i].equals(chooseList.get(j).getbId())){
                    temp.add(chooseList.get(j));
                }
            }
        }
        chooseList.clear();
        chooseList.addAll(temp);
        for(int i = 0;i<alldis.length;i++){
            System.out.println(alldis[i]);
        }
        // System.out.println(lon+","+lat+"gggg");
    }

    public  void input(Map<String,String> map){
        map.put("外借期刊","120.747186,31.651903");
        map.put("常熟文史资料中心","120.747186,31.651903");
        map.put("老馆文献中心","120.747186,31.651903");//老馆拥有
        map.put("中学生专架","120.747186,31.651903");//老馆拥有
        //map.put("乡镇、村(社区)流通点","120.639622,31.671878");//流通点比较多不知道怎么填,如果匹配到了,就直接删除,因为这个属于总介
        map.put("成人开架","120.747186,31.651903");    //老馆拥有
        map.put("流转书库","120.747186,31.651903");    //老馆拥有
        map.put("地下书库","120.747186,31.651903");    //老馆拥有
        map.put("地下书库二","120.747186,31.651903");    //老馆拥有
        map.put("成人书库(密)","120.747186,31.651903");//老馆拥有
        map.put("流转中心","120.747186,31.651903");
        map.put("古籍部","120.747186,31.651903");//老馆拥有
        map.put("书库","120.747186,31.651903");//老馆拥有
        map.put("阅览室","120.747186,31.651903");//老馆拥有
        map.put("参考阅览","120.747186,31.651903");//老馆拥有
        map.put("24小时自助借还","120.747186,31.651903");
        map.put("南图专架","120.747186,31.651903");
        map.put("视听室","120.747186,31.651903");
        map.put("盲文图书","120.747186,31.651903");
        map.put("双拥数字图书馆","120.747186,31.651903");
        map.put("廉政专架","120.747186,31.651903");
        map.put("地方文献","120.747186,31.651903");
        map.put("总控","120.747186,31.651903");
        map.put("采编辅导部","120.747186,31.651903");
        map.put("报刊阅览室","120.747186,31.651903");
        map.put("成人书库","120.747186,31.651903");
        map.put("组织部","120.747186,31.651903");
        //
        map.put("碧溪新区东张集镇社区","121.022553,31.704312");
        map.put("碧溪新区碧溪集镇社区","120.917632,31.758203");
        map.put("碧溪新区吴市集镇社区","121.002979,31.722167");
        map.put("辛庄福斯特","120.683929,31.532132");
        map.put("招商城","120.748071,31.631998");
        map.put("海虞镇府东村","120.81855,31.772354");
        map.put("四景小院","120.69226,31.649086");
        map.put("少儿书库(密)","120.746325,31.651329");
        map.put("少儿书库","120.746325,31.651329");
        map.put("少儿馆外流通点","120.746325,31.651329");
        map.put("少儿部","120.746325,31.651329");
        map.put("沿江开发区","121.053719,31.7381");
        map.put("董浜镇（农家书屋）","120.958618,31.691358");
        map.put("碧溪镇（农家书屋）","120.92274,31.725845");
        map.put("古里镇（农家书屋）","120.888298,31.60041");
        map.put("海虞镇（农家书屋）","120.817772,31.708698");
        map.put("虞山镇（农家书屋）","120.684783,31.705062");
        map.put("梅李镇（农家书屋）","120.929206,31.672658");
        map.put("尚湖镇（农家书屋）","120.601545,31.672507");
        map.put("支塘镇（农家书屋）","120.957138,31.624542");
        map.put("辛庄镇（农家书屋）","120.665337,31.562893");
        map.put("沙家浜镇（农家书屋）","120.783729,31.56129");
        map.put("公安局巡防大队","120.764378,31.636423");
        map.put("方塔园","120.755106,31.650963");
        map.put("碧溪开发区","120.94257,31.727238");
        map.put("东南街道办","120.834173,31.608575");
        map.put("通润驱动","120.737384,31.688523");
        map.put("地税一","120.755828,31.646493");
        map.put("政协","120.758883,31.6595");
        map.put("阿特斯有限公司","120.657947,31.542939");
        map.put("中医院","120.782726,31.685206");
        map.put("地税","120.76228,31.662737");
        map.put("波司登","120.907484,31.598522");
        map.put("文昌阁","1120.753343,31.651515");
        map.put("琴湖小学","120.770524,31.650583");
        map.put("东南开发区","120.867025,31.613557");
        map.put("沙家浜(常熟)","120.853759,31.552099");
        map.put("兴福寺","120.726492,31.671821");
        map.put("尚湖镇湖庄村","120.655892,31.661199");
        map.put("古里镇淼泉分馆","120.758883,31.6595");
        map.put("纪委","120.758883,31.6595");
        map.put("和庐文化","120.773881,31.672513");
        map.put("任阳老年书屋","120.96689,31.548838");
        map.put("圣峰建筑","120.729432,31.702321");
        map.put("海关","120.760924,31.663282");
        map.put("谢桥图书馆","120.758349,31.734607");
        map.put("碧溪镇图书馆","120.932746,31.748498");
        map.put("理工大学","120.743421,31.614975");
        map.put("报慈社区","120.750999,31.667045");
        map.put("常熟高新园中等专业学校","120.744962,31.70897");
        map.put("雷达站","120.724448,31.667092");
        map.put("边检站","120.955875,31.761806");
        map.put("大科园沃创咖啡厅","120.776776,31.670959");
        map.put("八百伴","120.762491,31.649243");
        map.put("卷云堂","120.739837,31.674953");
        map.put("松禅书院","120.748044,31.646709");
        map.put("曾赵园","120.742007,31.648024");
        map.put("碧溪24小时自助","120.922022,31.753794");
        map.put("海虞镇海福新城社区","120.79738,31.75183");
        map.put("栖居书院","120.798708,31.653659");
        map.put("小蜗牛康复训练中心","120.746613,31.660699");
        map.put("琴湖幼儿园","120.7715,31.650707");
        map.put("三峰分馆","120.716915,31.685953");
        map.put("文化创意园","120.736543,31.672307");
        map.put("大石山房","120.741093,31.652353");
        map.put("莫城管理区","120.725284,31.602166");
        map.put("望虞台","120.700373,31.649309");
        map.put("苏州汇科","120.664507,31.526305");
        map.put("服装城新建村","120.74402,31.629962");
        map.put("服装城青莲村","120.754408,31.627309");
        map.put("服装城湖泾村","120.749901,31.629074");
        map.put("支塘镇图书馆","120.973832,31.618533");
        map.put("支塘镇八字桥","120.960419,31.599453");
        map.put("支塘镇凤泾村","120.963779,31.56872");
        map.put("支塘镇支塘社区（阳桥）","120.966103,31.614551");
        map.put("支塘镇支东村","120.975041,31.621214");
        map.put("支塘镇窑镇村","120.999766,31.579891");
        map.put("支塘镇徐政村","120.948524,31.540151");
        map.put("支塘镇项桥村","121.014068,31.610587");
        map.put("支塘镇盛泾村","120.944856,31.550842");
        map.put("支塘镇任阳社区","120.963843,31.560905");
        map.put("支塘镇任南村","120.96928,31.526633");
        map.put("支塘镇蒋巷村","120.973747,31.511025");
        map.put("支塘镇何市社区","121.0019,31.644345");
        map.put("支塘镇何南村","121.018089,31.63287");
        map.put("支塘镇何东村","121.042554,31.628354");
        map.put("支塘镇何北村","121.012214,31.658729");
        map.put("支塘镇枫塘村","120.983814,31.612665");
        map.put("支塘镇丰联村","120.993301,31.535038");
        map.put("支塘镇长桥村","120.957138,31.624542");
        map.put("虞山镇","120.787966,31.638045");
        map.put("虞山镇莫城社区自助图书馆","120.732818,31.599328");
        map.put("虞山镇景泰社区","120.743453,31.693986");
        map.put("虞山镇衡泰社区","120.770788,31.679017");
        map.put("虞山镇虞枫社区","120.799985,31.68378");
        map.put("虞山镇中南社区","120.776082,31.65646");
        map.put("虞山镇虹桥管理区","120.785019,31.670096");
        map.put("虞山镇润欣社区","120.781636,31.680147");
        map.put("虞山镇珠江社区","120.771843,31.672744");
        map.put("虞山镇枫林社区","120.752709,31.66045");
        map.put("虞山镇南沙社区","120.746903,31.673579");
        map.put("虞山镇华山社区","120.757249,31.67256");
        map.put("虞山镇湖中社区","120.73337,31.636989");
        map.put("虞山镇胜湖社区","120.775241,31.647566");
        map.put("虞山镇中泾村","120.71047,31.744388");
        map.put("虞山镇昭文社区","120.774041,31.663727");
        map.put("虞山镇张坝社区","120.741585,31.680768");
        map.put("虞山镇虞园社区","120.763091,31.664689");
        map.put("虞山镇虞东社区","120.763252,31.668652");
        map.put("虞山镇甬江社区","120.746768,31.674686");
        map.put("虞山镇永红村","120.740753,31.744464");
        map.put("虞山镇迎春社区","120.760144,31.642824");
        map.put("虞山镇杨荡社区","120.792465,31.679021");
        map.put("虞山镇燕巷村","120.711608,31.608523");
        map.put("虞山镇颜北社区","120.757974,31.65039");
        map.put("虞山镇言里村","120.731918,31.598152");
        map.put("虞山镇烟雨社区","120.731632,31.63515");
        map.put("虞山镇压路机村","120.657273,31.715116");
        map.put("虞山镇星海社区","120.744325,31.684726");
        map.put("虞山镇兴隆社区","120.794765,31.674809");
        map.put("虞山镇兴福社区","120.736132,31.678108");
        map.put("虞山镇新造村","120.780663,31.697479");
        map.put("虞山镇新厍村","120.801107,31.636424");
        map.put("虞山镇新红村","120.77055,31.749528");
        map.put("虞山镇谢桥社区","120.759057,31.732292");
        map.put("虞山镇小义村","120.70454,31.706911");
        map.put("虞山镇西庄街社区","120.742097,31.643488");
        map.put("虞山镇西泾岸社区","120.744092,31.646965");
        map.put("虞山镇五星社区","120.757708,31.664277");
        map.put("虞山镇五新村","120.688318,31.706812");
        map.put("虞山镇泰山社区","120.767528,31.682754");
        map.put("虞山镇泰安社区","120.782411,31.660939");
        map.put("虞山镇泰安村","120.785316,31.657993");
        map.put("虞山镇世茂社区","120.779891,31.686921");
        map.put("虞山镇石墩村","120.787959,31.667524");
        map.put("虞山镇三星村","120.711986,31.662338");
        map.put("虞山镇三和村","120.693972,31.594106");
        map.put("虞山镇渠中村","120.787934,31.616401");
        map.put("虞山镇清和坊社区","120.753379,31.654852");
        map.put("虞山镇青龙社区","120.790067,31.638077");
        map.put("虞山镇勤丰村","120.760239,31.697264");
        map.put("虞山镇琴湖社区","120.773501,31.653613");
        map.put("虞山镇琴枫社区","120.756076,31.68573");
        map.put("虞山镇浦浜村","120.79754,31.6534");
        map.put("虞山镇庞浜社区","120.788189,31.647343");
        map.put("虞山镇藕渠社区","120.788907,31.632709");
        map.put("虞山镇南门社区","120.74906,31.641968");
        map.put("虞山镇莫城社区","120.732818,31.599328");
        map.put("虞山镇明晶村","120.741552,31.715239");
        map.put("虞山镇明晖社区","120.747637,31.68521");
        map.put("虞山镇闽江社区","120.757045,31.674176");
        map.put("虞山镇泯泾村","120.783412,31.692495");
        map.put("虞山镇梦兰村","120.77277,31.649133");
        map.put("虞山镇毛桥村","120.751752,31.702933");
        map.put("虞山镇绿源社区","120.765076,31.65495");
        map.put("虞山镇绿地社区","120.744229,31.69932");
        map.put("虞山镇菱塘社区","120.747128,31.661255");
        map.put("虞山镇联盟村","120.719415,31.687708");
        map.put("虞山镇李桥社区","120.752897,31.672081");
        map.put("虞山镇九里村","120.787928,31.672355");
        map.put("虞山镇景龙村","120.798844,31.693831");
        map.put("虞山镇锦荷社区","120.783922,31.64373");
        map.put("虞山镇金山社区","120.79321,31.64161");
        map.put("虞山镇花园浜社区","120.754431,31.640949");
        map.put("虞山镇花溪苑社区","120.767661,31.630382");
        map.put("虞山镇湖苑社区","120.771454,31.654489");
        map.put("虞山镇湖圩村","120.775722,31.644814");
        map.put("虞山镇洪泾里社区","120.775923,31.649374");
        map.put("虞山镇衡山社区","120.766557,31.675131");
        map.put("虞山镇荷花社区","120.78176,31.652268");
        map.put("虞山镇合丰村","120.707227,31.696019");
        map.put("虞山镇戈庄村","120.767938,31.621275");
        map.put("虞山镇富阳社区","120.782987,31.636357");
        map.put("虞山镇阜湖社区","120.757314,31.646467");
        map.put("虞山镇福圩村","120.763504,31.735774");
        map.put("虞山镇蜂蚁村","120.674817,31.708868");
        map.put("虞山镇枫泾社区","120.759111,31.653979");
        map.put("虞山镇方浜村","120.770982,31.722878");
        map.put("虞山镇翻身村","120.751787,31.73531");
        map.put("虞山镇东青村","120.742436,31.565351");
        map.put("虞山镇东联村","120.66656,31.690289");
        map.put("虞山镇东环村","120.794188,31.667386");
        map.put("虞山镇顶山村","120.716142,31.689355");
        map.put("虞山镇丁坝社区","120.745855,31.689562");
        map.put("虞山镇大虹桥村","120.805687,31.681683");
        map.put("虞山镇常隆村","120.699971,31.747385");
        map.put("虞山镇常福社区","120.739329,31.674961");
        map.put("虞山镇常福村","120.756034,31.744027");
        map.put("虞山镇漕泾社区","120.772266,31.66492");
        map.put("虞山镇漕湖社区","120.776817,31.657373");
        map.put("虞山镇北门社区","120.749705,31.656975");
        map.put("虞山镇报南社区","120.748049,31.664138");
        map.put("虞山镇报本社区","120.748466,31.644943");
        map.put("虞山镇报北社区","120.74925,31.669318");
        map.put("虞山镇长瑞村","120.708843,31.567279");
        map.put("虞山镇光明村","120.686129,31.736353");
        map.put("虞山镇学前社区","120.75593,31.646745");
        map.put("虞山镇三塘村","120.723923,31.6201");
        map.put("虞山镇花溪社区","120.767234,31.633654");
        map.put("虞山镇环湖社区","120.756766,31.624012");
        map.put("虞山镇泰慈村","120.774327,31.676098");
        map.put("虞山镇小山村","120.700247,31.704715");
        map.put("虞山镇和甸村","120.707323,31.608682");
        map.put("虞山镇四丈湾社区","120.745537,31.642182");
        map.put("虞山镇安定村","120.73553,31.622383");
        map.put("虞山镇湖鹤村","120.718102,31.584389");
        map.put("虞山镇东始村","120.70617,31.587441");
        map.put("虞山镇大义社区","120.691855,31.710117");
        map.put("辛庄镇图书馆","120.697785,31.54173");
        map.put("辛庄镇平墅村","120.630419,31.590478");
        map.put("辛庄镇双浜村","120.656494,31.525763");
        map.put("辛庄镇辛中村","120.699903,31.536576");
        map.put("辛庄镇嘉菱村","120.590202,31.609533");
        map.put("辛庄镇沈浜村","120.668092,31.580736");
        map.put("辛庄镇朱家桥村","120.631583,31.561316");
        map.put("辛庄镇张居","120.745482,31.678983");
        map.put("辛庄镇张家桥村","120.607552,31.604624");
        map.put("辛庄镇张港泾村","120.679315,31.53203");
        map.put("辛庄镇杨中村","120.672975,31.581542");
        map.put("辛庄镇杨居","120.664539,31.564147");
        map.put("辛庄镇辛居","120.683274,31.544093");
        map.put("辛庄镇卫家塘村","120.565521,31.599686");
        map.put("辛庄镇旺倪桥村","120.614579,31.583872");
        map.put("辛庄镇桃园村","120.667287,31.566839");
        map.put("辛庄镇潭荡村","120.695318,31.544623");
        map.put("辛庄镇南湖农场","120.677562,31.603636");
        map.put("辛庄镇吕舍村","120.694971,31.51479");
        map.put("辛庄镇金荡村","120.691757,31.559549");
        map.put("辛庄镇华欣村","120.723468,31.541553");
        map.put("辛庄镇合泰村","120.72469,31.548797");
        map.put("辛庄镇洞港泾村","120.66047,31.532569");
        map.put("辛庄镇东旺村","120.613481,31.595421");
        map.put("辛庄镇常南村","120.673303,31.510555");
        map.put("辛庄镇阿特斯有限公司","120.657947,31.542939");
        map.put("尚湖镇图书馆","120.641361,31.668721");
        map.put("尚湖镇鸳鸯桥村","120.681874,31.616532");
        map.put("尚湖镇山鑫村","120.600596,31.728037");
        map.put("尚湖镇新巷村","120.639622,31.671878");
        map.put("尚湖镇张村村","120.615293,31.710458");
        map.put("尚湖镇冶塘社区","120.641361,31.668721");
        map.put("尚湖镇颜巷村","120.696015,31.626495");
        map.put("尚湖镇新裕村","120.640668,31.707068");
        map.put("尚湖镇新鑫村","120.618198,31.673878");
        map.put("尚湖镇新和村","120.653156,31.66638");
        map.put("尚湖镇下庄村","120.6601,31.645413");
        map.put("尚湖镇翁家庄村","120.602586,31.641444");
        map.put("尚湖镇王庄社区","120.590202,31.691434");
        map.put("尚湖镇南村坝村","120.592092,31.734468");
        map.put("尚湖镇罗墩村","120.642053,31.635631");
        map.put("尚湖镇练塘社区","120.636699,31.621476");
        map.put("尚湖镇练南村","120.643622,31.618181");
        map.put("尚湖镇蒋巷镇村","120.670745,31.647452");
        map.put("尚湖镇家鑫村","120.600212,31.689865");
        map.put("尚湖镇吉桥村","120.633295,31.62547");
        map.put("尚湖镇河金村","120.601545,31.672507");
        map.put("尚湖镇福寿村","120.588112,31.672275");
        map.put("尚湖镇东桥村","120.590624,31.694818");
        map.put("尚湖镇大河村","120.625402,31.690188");
        map.put("尚湖镇车路坝村","120.60936,31.730949");
        map.put("尚湖镇常兴村","120.661916,31.611597");
        map.put("沙家浜","120.861732,31.552888");
        map.put("沙家浜苏南村","120.855821,31.548494");
        map.put("沙家浜昆承湖","120.752781,31.592415");
        map.put("沙家浜常昆村","120.85108,31.556174");
        map.put("沙家浜红石村","120.783729,31.56129");
        map.put("沙家浜沙南村","120.781962,31.564361");
        map.put("沙家浜新湖村","120.864084,31.536661");
        map.put("沙家浜唐市社区","120.855821,31.548494");
        map.put("沙家浜唐东村","120.877463,31.564551");
        map.put("沙家浜唐北村","120.81959,31.57135");
        map.put("沙家浜芦荡社区","120.785264,31.562628");
        map.put("沙家浜芦荡村","120.799177,31.544628");
        map.put("沙家浜朗城村","120.840685,31.545837");
        map.put("沙家浜昆南村","120.768994,31.550737");
        map.put("沙家浜华阳村","120.858078,31.550082");
        map.put("沙家浜横泾村","120.842759,31.670047");
        map.put("梅李镇图书馆","120.883853,31.71214");
        map.put("梅李镇寨角村","120.86694,31.685072");
        map.put("梅李镇赵市社区","120.843588,31.755037");
        map.put("梅李镇珍南村","120.900203,31.681603");
        map.put("梅李镇珍门社区","120.902418,31.682788");
        map.put("梅李镇珍北村","120.910964,31.6979");
        map.put("梅李镇赵市村","120.849629,31.744198");
        map.put("梅李镇新丰村","120.929206,31.672658");
        map.put("梅李镇圩港村","120.845773,31.756872");
        map.put("梅李镇天字村","120.874144,31.727869");
        map.put("梅李镇塘桥村","120.855932,31.704552");
        map.put("梅李镇师桥村","120.87461,31.760559");
        map.put("梅李镇胜法村","120.869304,31.720698");
        map.put("梅李镇沈市村","120.91424,31.66766");
        map.put("梅李镇梅南村","120.877435,31.707654");
        map.put("梅李镇梅李社区","120.880516,31.710585");
        map.put("梅李镇瞿巷村","120.868719,31.762082");
        map.put("梅李镇聚沙村","120.891938,31.715835");
        map.put("梅李镇海城村","120.850682,31.76066");
        map.put("虞山林场","120.732527,31.674368");
        map.put("林场建华村","120.708613,31.626328");
        map.put("林场元和村","120.735693,31.640116");
        map.put("林场虞北社区","120.728352,31.682884");
        map.put("林场兴福管理区","120.731937,31.671351");
        map.put("林场泄水村","120.674611,31.679431");
        map.put("林场尚湖社区","120.714335,31.651677");
        map.put("林场山前社区","120.733653,31.650771");
        map.put("林场三峰管理区","120.711294,31.686541");
        map.put("林场甸桥村","120.733554,31.650693");
        map.put("林场大湖甸村","120.719226,31.652117");
        map.put("林场宝岩管理区","120.696607,31.673619");
        map.put("林场宝岩村","120.694652,31.67319");
        map.put("海虞镇图书馆","120.811241,31.75099");
        map.put("海虞镇螺丝湾","120.820818,31.773863");
        map.put("海虞镇周行社区","120.814312,31.714201");
        map.put("海虞镇郑家桥村","120.736838,31.778105");
        map.put("海虞镇虞南村","120.790812,31.720101");
        map.put("海虞镇徐桥村","120.755598,31.770122");
        map.put("海虞镇新洲村","120.803568,31.717053");
        map.put("海虞镇肖桥村","120.764158,31.772494");
        map.put("海虞镇香桥村","120.817772,31.708698");
        map.put("海虞镇望虞村","120.803375,31.763304");
        map.put("海虞镇王市社区","120.810721,31.753333");
        map.put("海虞镇汪桥村","120.827526,31.701393");
        map.put("海虞镇七峰村","120.742042,31.791863");
        map.put("海虞镇龙灯村","120.791181,31.746778");
        map.put("海虞镇里泾村","120.821444,31.701857");
        map.put("海虞镇聚福村","120.772893,31.796985");
        map.put("海虞镇河口村","120.81855,31.772354");
        map.put("海虞镇福山社区","120.770717,31.807393");
        map.put("海虞镇福山村","120.770464,31.80616");
        map.put("海虞镇东泾村","120.803698,31.737054");
        map.put("海虞镇邓市村","120.801481,31.778405");
        map.put("董浜镇图书馆","120.939983,31.653943");
        map.put("董浜镇杨塘村","120.942409,31.684521");
        map.put("董浜镇徐市社区","120.965206,31.677451");
        map.put("董浜镇黄石村","120.970265,31.676214");
        map.put("董浜镇智林村","120.958618,31.691358");
        map.put("董浜镇永安村","120.945846,31.648198");
        map.put("董浜镇新民村","120.952632,31.658097");
        map.put("董浜镇天星村","120.944808,31.662581");
        map.put("董浜镇旗杆村","120.963759,31.679618");
        map.put("董浜镇陆市村","120.96886,31.702264");
        map.put("董浜镇里睦村","120.985772,31.661195");
        map.put("董浜镇红沙村","120.925863,31.647762");
        map.put("董浜镇观智村","120.899599,31.63518");
        map.put("董浜镇杜桥村","120.921208,31.631705");
        map.put("董浜镇董浜社区","120.940362,31.645551");
        map.put("董浜镇东盾村","120.986395,31.664046");
        map.put("董浜镇北港村","121.004216,31.684157");
        map.put("东南街道小康村","120.830329,31.621702");
        map.put("东南街道苏峰村","120.789059,31.602496");
        map.put("东南街道昆承村","120.805806,31.605247");
        map.put("东南街道湖东社区","120.794854,31.602795");
        map.put("东南街道东渔村","120.804441,31.606182");
        map.put("碧溪新区浒东村","120.928767,31.752745");
        map.put("碧溪新区浒浦集镇社区","120.917893,31.757917");
        map.put("碧溪新区周泾村","120.935737,31.700758");
        map.put("碧溪新区周家桥村","120.987438,31.702611");
        map.put("碧溪新区中南村","121.035899,31.710319");
        map.put("碧溪新区徐虎村","120.95462,31.72053");
        map.put("碧溪新区新闸村","121.057474,31.711743");
        map.put("碧溪新区新苑村","121.040354,31.682462");
        map.put("碧溪新区小市村","120.967789,31.737303");
        map.put("碧溪新区溪南村","120.939752,31.721636");
        map.put("碧溪新区溪东村","120.945122,31.731732");
        map.put("碧溪新区万福村","121.000468,31.716312");
        map.put("碧溪新区太平桥村","120.984297,31.731158");
        map.put("碧溪新区泗湖村","121.001694,31.723594");
        map.put("碧溪新区三湾村","120.991555,31.746824");
        map.put("碧溪新区龙桥村","121.007751,31.703774");
        map.put("碧溪新区留下村","120.882929,31.74543");
        map.put("碧溪新区李袁村","120.894179,31.734024");
        map.put("碧溪新区李村村","120.915112,31.727176");
        map.put("碧溪新区聚福苑社区","120.949261,31.745517");
        map.put("碧溪新区浒西村","120.917673,31.752254");
        map.put("碧溪新区浒浦渔业社区","120.930858,31.756242");
        map.put("碧溪新区横塘村","121.040879,31.692485");
        map.put("碧溪新区港南村","120.92274,31.725845");
        map.put("碧溪新区东江村","121.035013,31.716468");
        map.put("碧溪新区白莲村","121.020868,31.693126");
        map.put("古里镇图书馆","120.839532,31.64255");
        map.put("古里镇吴庄村","120.820811,31.66063");
        map.put("古里镇紫霞村","120.926857,31.614777");
        map.put("古里镇紫芙社区","120.908957,31.601103");
        map.put("古里镇新桥村","120.812602,31.643904");
        map.put("古里镇下甲村","120.898594,31.551627");
        map.put("古里镇坞丘村","120.887209,31.596074");
        map.put("古里镇苏家尖村","120.875154,31.635293");
        map.put("古里镇双港社区","120.846552,31.633715");
        map.put("古里镇琴东村","120.855499,31.627897");
        map.put("古里镇淼泉社区","120.835939,31.668154");
        map.put("古里镇联泾村","120.900049,31.576261");
        map.put("古里镇李市村","120.922235,31.564098");
        map.put("古里镇康博村","120.933534,31.591787");
        map.put("古里镇湖东村","120.815856,31.633136");
        map.put("古里镇高长村","120.857993,31.656952");
        map.put("古里镇芙蓉村","120.888298,31.60041");
        map.put("古里镇陈塘村","120.839311,31.687758");
    }
}
